In [673]:
import torch
import pandas as pd
from sklearn.model_selection import train_test_split
import numpy as np

In [674]:
train_data = pd.read_csv('/Users/artemarhipov/Downloads/titanic/train.csv')
test_data = pd.read_csv('/Users/artemarhipov/Downloads/titanic/test.csv')

In [675]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [676]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [677]:
print(train_data.shape,test_data.shape)

(891, 12) (418, 11)

In [678]:
train_data = train_data.drop(['Name','Ticket','Cabin'],axis = 1)
test_data = test_data.drop(['Name','Ticket','Cabin'],axis = 1)

In [679]:
print(train_data.shape,test_data.shape)

(891, 9) (418, 8)

In [680]:
y_test = pd.read_csv('/Users/artemarhipov/Downloads/titanic/gender_submission.csv')

In [681]:
y_test.shape

(418, 2)

In [682]:
y_test.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [683]:
test_data = test_data.merge(y_test)

In [684]:
test_data.shape

(418, 9)

In [685]:
train_data.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [686]:
test_data.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0          892       3    male  34.5      0      0   7.8292        Q         0
1          893       3  female  47.0      1      0   7.0000        S         1
2          894       2    male  62.0      0      0   9.6875        Q         0
3          895       3    male  27.0      0      0   8.6625        S         0
4          896       3  female  22.0      1      1  12.2875        S         1

In [687]:
train_data.loc[train_data.Sex == 'male','Sex'] = 1
train_data.loc[train_data.Sex == 'female','Sex'] = 0

In [688]:
train_data.head(6)

   PassengerId  Survived  Pclass Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3   1  22.0      1      0   7.2500        S
1            2         1       1   0  38.0      1      0  71.2833        C
2            3         1       3   0  26.0      0      0   7.9250        S
3            4         1       1   0  35.0      1      0  53.1000        S
4            5         0       3   1  35.0      0      0   8.0500        S
5            6         0       3   1   NaN      0      0   8.4583        Q

In [689]:
test_data.loc[test_data.Sex == 'male','Sex'] = 1
test_data.loc[test_data.Sex == 'female','Sex'] = 0

In [690]:
test_data.head()

   PassengerId  Pclass Sex   Age  SibSp  Parch     Fare Embarked  Survived
0          892       3   1  34.5      0      0   7.8292        Q         0
1          893       3   0  47.0      1      0   7.0000        S         1
2          894       2   1  62.0      0      0   9.6875        Q         0
3          895       3   1  27.0      0      0   8.6625        S         0
4          896       3   0  22.0      1      1  12.2875        S         1

In [691]:
train_data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [692]:
test_data.Embarked.unique()

array(['Q', 'S', 'C'], dtype=object)

In [693]:
train_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [694]:
mean_male = train_data[train_data.Sex == 1].Age.mean()

In [695]:
mean_male

30.72664459161148

In [696]:
mean_female = train_data[train_data.Sex == 0].Age.mean()

In [697]:
mean_female

27.915708812260537

In [698]:
train_data.loc[(train_data.Sex == 1)&(train_data.Age.isna()),'Age'] = mean_male
train_data.loc[(train_data.Sex == 0)&(train_data.Age.isna()),'Age'] = mean_female

In [699]:
train_data.head(6)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,1,22.000000,1,0,7.2500,S
1,2,1,1,0,38.000000,1,0,71.2833,C
2,3,1,3,0,26.000000,0,0,7.9250,S
3,4,1,1,0,35.000000,1,0,53.1000,S
4,5,0,3,1,35.000000,0,0,8.0500,S
5,6,0,3,1,30.726645,0,0,8.4583,Q

In [700]:
train_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

In [701]:
train_data.shape

(891, 9)

In [702]:
train_data = train_data.dropna()

In [703]:
train_data.shape

(889, 9)

In [704]:
train_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [705]:
test_data.isna().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked        0
Survived        0
dtype: int64

In [706]:
test_data.loc[(test_data.Sex == 1)&(test_data.Age.isna()),'Age'] = mean_male
test_data.loc[(test_data.Sex == 0)&(test_data.Age.isna()),'Age'] = mean_female

In [707]:
test_data.isna().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           1
Embarked       0
Survived       0
dtype: int64

In [708]:
test_data.shape

(418, 9)

In [709]:
test_data = test_data.fillna(test_data.Fare.mean())

In [710]:
test_data.shape

(418, 9)

In [711]:
train_data.loc[(train_data.Embarked == 'Q'),'Embarked'] = 1
train_data.loc[(train_data.Embarked == 'S'),'Embarked'] = 2
train_data.loc[(train_data.Embarked == 'C'),'Embarked'] = 3

test_data.loc[(test_data.Embarked == 'Q'),'Embarked'] = 1
test_data.loc[(test_data.Embarked == 'S'),'Embarked'] = 2
test_data.loc[(test_data.Embarked == 'C'),'Embarked'] = 3

In [712]:
train_data.head()

   PassengerId  Survived  Pclass Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3   1  22.0      1      0   7.2500        2
1            2         1       1   0  38.0      1      0  71.2833        3
2            3         1       3   0  26.0      0      0   7.9250        2
3            4         1       1   0  35.0      1      0  53.1000        2
4            5         0       3   1  35.0      0      0   8.0500        2

In [713]:
test_data.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Survived
0          892       3    1  34.5      0      0   7.8292        1         0
1          893       3    0  47.0      1      0   7.0000        2         1
2          894       2    1  62.0      0      0   9.6875        1         0
3          895       3    1  27.0      0      0   8.6625        2         0
4          896       3    0  22.0      1      1  12.2875        2         1

In [714]:
X_test = test_data.drop(['Survived'],axis = 1)
y_test = test_data.Survived

In [715]:
X_train,X_validation,y_train,y_validation = \
                train_test_split(train_data.drop('Survived',axis = 1),train_data.Survived,\
                                 test_size = 0.33,random_state = 0)

In [716]:
X_train.head()

     PassengerId  Pclass Sex   Age  SibSp  Parch    Fare Embarked
171          172       3   1   4.0      4      1  29.125        1
188          189       3   1  40.0      1      1  15.500        1
799          800       3   0  30.0      1      1  24.150        2
433          434       3   1  17.0      0      0   7.125        2
651          652       2   0  18.0      0      1  23.000        2

In [717]:
X_validation.head()

     PassengerId  Pclass Sex        Age  SibSp  Parch      Fare Embarked
14            15       3   0  14.000000      0      0    7.8542        2
159          160       3   1  30.726645      8      2   69.5500        2
763          764       1   0  36.000000      1      2  120.0000        2
741          742       1   1  36.000000      1      0   78.8500        2
483          484       3   0  63.000000      0      0    9.5875        2

In [718]:
y_train.head()

171    0
188    0
799    0
433    0
651    1
Name: Survived, dtype: int64

In [719]:
y_validation.head()

14     0
159    0
763    1
741    0
483    1
Name: Survived, dtype: int64

In [720]:
from sklearn.ensemble import RandomForestClassifier

In [721]:
clf1 = RandomForestClassifier()

In [722]:
clf2 = RandomForestClassifier()

In [723]:
from sklearn.model_selection import RandomizedSearchCV

In [724]:
params = {'n_estimators':range(200,300,20),'max_depth':range(1,30),\
         'min_samples_split':range(2,20),'min_samples_leaf':range(1,20)}

In [725]:
searcher1 = RandomizedSearchCV(clf1,params,cv = 5)

In [726]:
searcher2 = RandomizedSearchCV(clf2,params,cv = 5)

In [727]:
searcher1.fit(X_train,y_train)

RandomizedSearchCV(cv=5, estimator=RandomForestClassifier(),
                   param_distributions={'max_depth': range(1, 30),
                                        'min_samples_leaf': range(1, 20),
                                        'min_samples_split': range(2, 20),
                                        'n_estimators': range(200, 300, 20)})

In [728]:
searcher1.best_params_

{'n_estimators': 280,
 'min_samples_split': 5,
 'min_samples_leaf': 2,
 'max_depth': 27}

In [729]:
searcher2.fit(train_data.drop('Survived',axis = 1),train_data.Survived)

RandomizedSearchCV(cv=5, estimator=RandomForestClassifier(),
                   param_distributions={'max_depth': range(1, 30),
                                        'min_samples_leaf': range(1, 20),
                                        'min_samples_split': range(2, 20),
                                        'n_estimators': range(200, 300, 20)})

In [730]:
searcher2.best_params_

{'n_estimators': 260,
 'min_samples_split': 13,
 'min_samples_leaf': 4,
 'max_depth': 17}

In [731]:
searcher1.score(X_validation,y_validation)

0.8061224489795918

In [732]:
searcher2.score(X_validation,y_validation)

0.8741496598639455

In [733]:
searcher1.score(X_test,y_test)

0.8516746411483254

In [734]:
searcher2.score(X_test,y_test)

0.8349282296650717

In [735]:
clf1 = searcher1.best_estimator_

In [736]:
clf2 = searcher2.best_estimator_

In [741]:
val_scores = pd.read_csv('/Users/artemarhipov/Downloads/titanic/gender_submission.csv')

In [743]:
predicted1 = pd.DataFrame(index = val_scores.PassengerId,data = {'Survived':clf1.predict(X_test)})

In [744]:
predicted2 = pd.DataFrame(index = val_scores.PassengerId,data = {'Survived':clf2.predict(X_test)})

In [746]:
predicted1_csv = predicted1.to_csv(path_or_buf='/Users/artemarhipov/Downloads/titanic_kaggle_1clf_23.csv')
predicted2_csv = predicted2.to_csv(path_or_buf='/Users/artemarhipov/Downloads/titanic_kaggle_2clf_23.csv')